[
    {
        "id": 1001,
        "name": "Course: Networking",
        "image": "10",
        "shortName": "Networking",
        "category": "Courses",
        "description": "When working with any external data, be it updating weather data, streaming music, or simply surfing the browser, your application uses HTTP network requests. They are the ones responsible for everything related to the outside world.",
        "rating": 8.9,
        "students": 5334,
        "lessons": 37,
        "isFavorite": false,
        "isFeatured": false
    },
    {
        "id": 2,
        "name": "Course: Firebase - Our First App",
        "image": "12",
        "shortName": "Firebase - Our First App",
        "category": "Courses",
        "description": "New Firebase Course: Our First App will introduce you to the basics of the Firebase service, where we will introduce you to the two most in-demand Firebase services when building almost any app - Firebase Authentication (user authentication) and Firebase Realtime Database (a database that instantly updates and allows you to display changes immediately after they occur).",
        "rating": 9.3,
        "students": 2355,
        "lessons": 10,
        "isFavorite": false,
        "isFeatured": false
    },
    {
        "id": 3,
        "name": "Course: Notifications",
        "image": "23",
        "shortName": "Notifications",
        "category": "Courses",
        "description": "We present to your attention a course entirely dedicated to notifications. But what are notifications? Notifications are small messages that carry important information to the user about your application or about some event. That is, you already guess that notifications play an important role in the user's interaction with the application and can lead to an increase in the number of user contacts with your application and, accordingly, to loyalty. Given all this, it would be nice to know how to create these very notifications and how to customize them in order to accurately fit them into your applications.",
        "rating": 9.2,
        "students": 1853,
        "lessons": 19,
        "isFavorite": false,
        "isFeatured": false
    },
    {
        "id": 4,
        "name": "Course: Meta News Feed App",
        "image": "27",
        "shortName": "Meta News Feed App",
        "category": "Courses",
        "description": "Have you ever wondered how applications are created in the real world? Have you ever wanted to try yourself in writing a full-fledged modern application? Have you long planned to start developing an application interface through code? We present you our new exciting course, which will be devoted to creating an application similar to the Meta news feed using various JSON APIs directly from the Meta server.",
        "rating": 9.9,
        "students": 5201,
        "lessons": 32,
        "isFavorite": false,
        "isFeatured": false
    },
    {
        "id": 5,
        "name": "Swift Programming Basics",
        "image": "w1",
        "shortName": "Swift Programming Basics",
        "category": "Webinars",
        "description": "Our program is designed for 16 hours of online collaboration and 30 hours of homework. This program will give you the opportunity to build a solid foundation of your knowledge. Studying 2 times a week for 2 hours for 1 month, you will get a solid base of modern knowledge of the basics of the Swift language! You will be able to confidently navigate the world of code. Your knowledge will become the foundation necessary for writing your future applications!",
        "rating": 9.3,
        "students": 943,
        "lessons": 8,
        "isFavorite": false,
        "isFeatured": false
    },
    {
        "id": 6,
        "name": "My first apps",
        "image": "w2",
        "shortName": "My first apps",
        "category": "Webinars",
        "description": "To enroll in the My First Apps course, you need to complete the Swift Programming Basics course (webinars) or the Programming Basics and Swift Programming Language Guide courses on our resource in the Courses section. This is the necessary theoretical base that will allow you to move forward. Classes will be held 2 times a week for 2 hours for 1 month. During this period, you will not only be able to reliably master new knowledge of the Swift language, but also consolidate the basic knowledge you have acquired earlier. The result of your training will be writing an application! In the lessons, you will also write small applications, implementing theoretical knowledge in practice!",
        "rating": 8.8,
        "students": 743,
        "lessons": 8,
        "isFavorite": false,
        "isFeatured": false
    },
    {
        "id": 7,
        "name": "Swift Developer",
        "image": "w3",
        "shortName": "Swift Developer",
        "category": "Webinars",
        "description": "The webinars are based on the official Apple program Everyone can program. \nAlready 70 European colleges and universities have implemented this course in a comprehensive educational program, within which anyone can learn to create mobile applications. These are educational institutions of Great Britain, Germany, France, Italy, Spain, the Netherlands, Sweden, Denmark, Norway, Austria, Belgium, the Czech Republic, Ireland, Luxembourg, Poland and Portugal. \nNow you can study according to this program at our webinars!",
        "rating": 9.0,
        "students": 643,
        "lessons": 24,
        "isFavorite": false,
        "isFeatured": false
    },
    {
        "id": 8,
        "name": "Server Side Swift Developer",
        "image": "w4",
        "shortName": "Server Side Swift Developer",
        "category": "Webinars",
        "description": "Server Side Swift Developer - not an iOS developer who can write iOS applications, but a developer of the server side of any applications! That is, this series gives you a new layer of knowledge based on the knowledge of the same Swift, which you can use to write your own backend for your, or maybe for the customer's applications!",
        "rating": 9.7,
        "students": 346,
        "lessons": 24,
        "isFavorite": false,
        "isFeatured": false
    }
]
